hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
void (*send_usart_data_function_g)() = NULL;
void (*on_response_g)() = NULL;
volatile unsigned int send_usart_data_time_counter_g;
volatile unsigned short send_usart_data_timout_sec_g = 0xFFFF;
volatile unsigned char send_usart_data_errors_counter_g;
volatile unsigned short send_usart_data_errors_unresetable_counter_g;
volatile unsigned int last_error_task;
volatile unsigned short network_searching_status_led_counter_g;
volatile unsigned short response_timeout_timer_g;
volatile unsigned char esp8266_disabled_counter_g;
volatile unsigned char esp8266_disabled_timer_g = TIMER6_5S;
unsigned short checking_connection_status_and_server_availability_counter_g;
volatile unsigned short visible_network_list_counter_g;
volatile unsigned short beeper_inactive_timer_g;
volatile unsigned char beeper_period_timer_g;
volatile unsigned char beeper_alarm_prior_to_response_period_timer_g;

volatile unsigned short usart_overrun_errors_counter_g;
volatile unsigned short usart_idle_line_detection_counter_g;
volatile unsigned short usart_noise_detection_counter_g;
volatile unsigned short usart_framing_errors_counter_g;

void IWDG_Config();
void Clock_Config();
void Pins_Config();
void TIMER3_Confing();
void TIMER6_Confing();
void EXTERNAL_Interrupt_Config();
void beep_and_schedule_alarm(unsigned char *beeper_counter);
void turn_beeper_on();
void turn_beeper_off();
void set_flag(unsigned int *flags, unsigned int flag_value);
void reset_flag(unsigned int *flags, unsigned int flag_value);
unsigned char read_flag_state(unsigned int *flags, unsigned int flag_value);
void DMA_Config();
void USART_Config();
void set_appropriate_successfully_recieved_flag();
void disable_echo();
void get_network_list();
void connect_to_network();
void get_connection_status();
void execute_usart_data_sending(void (*function_to_execute)(), unsigned char timeout, unsigned char execute_function);
void send_usard_data(char string[]);
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count);
unsigned char is_usart_response_contains_element(char string_to_be_contained[]);
unsigned char contains_string(char being_compared_string[], char string_to_be_contained[]);
void clear_usart_data_received_buffer();
unsigned short get_received_data_length();
unsigned char is_received_data_length_equal(unsigned short length);
void *set_string_parameters(char string[], char *parameters[]);
unsigned short get_string_length(char string[]);
unsigned int get_current_piped_task_to_send();
void delete_current_piped_task();
void add_piped_task_to_send_into_tail(unsigned int task);
void add_piped_task_to_send_into_head(unsigned int task);
void delete_piped_task(unsigned int task);
void on_successfully_receive_general_actions(unsigned int successfully_received_flag);
void prepare_http_request(char address[], char port[], char request[], void (*on_response)(), unsigned int request_task);
void resend_usart_get_request_using_global_final_task();
void *num_to_string(unsigned int number);
void *array_to_string(char array[], unsigned char array_length);
void connect_to_server();
void resend_usart_get_request(unsigned int final_task);
void set_bytes_amount_to_send();
void send_request(unsigned int sent_flag_to_set);
void action_on_response();
void get_current_default_wifi_mode();
void set_default_wifi_mode();
void enable_esp8266();
void disable_esp8266();
unsigned char is_esp8266_enabled(unsigned char include_timer);
void clear_piped_request_commands_to_send();
void delete_all_piped_tasks();
unsigned char is_piped_task_to_send_scheduled(unsigned int task);
unsigned char is_piped_tasks_scheduler_full();
unsigned char is_piped_tasks_scheduler_empty();
void execute_function_for_current_piped_task(unsigned int current_piped_task_to_send, unsigned char send_usart_data_passed_time_sec);
void get_server_avalability(unsigned int request_task);
void send_alarm(unsigned int request_task);
void get_own_ip_address();
void set_own_ip_address();
void close_connection();
void set_appropriate_successfully_recieved_flag_general_action(unsigned int flag_value, char to_be_contained_in_response[]);
void add_error();
void check_connection_status_and_server_availability(unsigned short *counter);
void add_piped_task_into_history(unsigned int task);
unsigned int get_last_piped_task_in_history();
void save_default_access_point_gain();

void SysTick_Handler() {
   if (GPIO_ReadOutputDataBit(BEEPER_PORT, BEEPER_PIN)) {
      GPIO_WriteBit(BEEPER_PORT, BEEPER_PIN, Bit_RESET);
   } else {
      GPIO_WriteBit(BEEPER_PORT, BEEPER_PIN, Bit_SET);
   }
}

void DMA1_Channel2_3_IRQHandler() {
   DMA_ClearITPendingBit(DMA1_IT_TC2);
}

/**
 * TIM6 and DAC
 */
void TIM6_DAC_IRQHandler() {
   TIM_ClearITPendingBit(TIM6, TIM_IT_Update);

   response_timeout_timer_g++;
   visible_network_list_counter_g++;
   checking_connection_status_and_server_availability_counter_g++;
   if (!is_esp8266_enabled(0)) {
      esp8266_disabled_counter_g++;
   }
   if (esp8266_disabled_timer_g > 0) {
      esp8266_disabled_timer_g--;
   }
   if (beeper_inactive_timer_g) {
      beeper_inactive_timer_g--;
   }
   if (beeper_period_timer_g) {
      beeper_period_timer_g--;
   }
   if (beeper_alarm_prior_to_response_period_timer_g) {
      beeper_alarm_prior_to_response_period_timer_g--;
   }
}

void TIM3_IRQHandler() {
   TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

   // Some error eventually occurs when only the first symbol is exists
   if (usart_received_bytes_g > 1) {
      set_flag(&general_flags_g, USART_DATA_RECEIVED_FLAG);
   }
   usart_received_bytes_g = 0;
   if (send_usart_data_function_g != NULL) {
      send_usart_data_time_counter_g++;
   }
   network_searching_status_led_counter_g++;
}

void EXTI2_3_IRQHandler() {
   if (EXTI_GetITStatus(EXTI_Line3)) {
      EXTI_ClearITPendingBit(EXTI_Line3);

      if (GPIO_ReadInputDataBit(MOTION_SENSOR_INPUT_PORT, MOTION_SENSOR_INPUT_PIN)) {
         GPIO_WriteBit(MOTION_SENSOR_LED_PORT, MOTION_SENSOR_LED_PIN, Bit_SET);

         set_flag(&general_flags_g, ALARM_FLAG);
      } else {
         GPIO_WriteBit(MOTION_SENSOR_LED_PORT, MOTION_SENSOR_LED_PIN, Bit_RESET);
      }
   }
}

