hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
               if (!is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_STATION_MODE)) {
                  add_piped_task_to_send_into_head(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, GET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(GET_OWN_IP_ADDRESS_FLAG);

               unsigned char some_another_ip = !is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS);
               if (some_another_ip) {
                  add_piped_task_to_send_into_head(SET_OWN_IP_ADDRESS_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, SET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(SET_OWN_IP_ADDRESS_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, CLOSE_CONNECTION_FLAG)) {
               on_successfully_receive_general_actions(CLOSE_CONNECTION_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, GET_SERVER_AVAILABILITY_REQUEST_FLAG)) {
               on_successfully_receive_general_actions(GET_SERVER_AVAILABILITY_REQUEST_FLAG);

               if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE) ||
                     is_usart_response_contains_element(ESP8226_RESPONSE_HTTP_STATUS_200_OK)) {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
                  checking_connection_status_and_server_availability_counter_g = 0;
               } else {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, SEND_ALARM_REQUEST_FLAG)) {
               on_successfully_receive_general_actions(SEND_ALARM_REQUEST_FLAG);

               if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE) ||
                     is_usart_response_contains_element(ESP8226_RESPONSE_HTTP_STATUS_200_OK)) {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
                  set_flag(&general_flags_g, ALARM_SERVER_RECEIVED_FLAG);
               } else {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
               }

            }
         }

         unsigned int current_piped_task_to_send = get_current_piped_task_to_send();
         execute_function_for_current_piped_task(current_piped_task_to_send, send_usart_data_passed_time_sec);

         check_connection_status_and_server_availability(&checking_connection_status_and_server_availability_counter_g);

         if (visible_network_list_counter_g >= TIMER6_10MIN) {
            visible_network_list_counter_g = 0;
            add_piped_task_to_send_into_tail(GET_VISIBLE_NETWORK_LIST_FLAG);
         }

         // LED blinking
         if (network_searching_status_led_counter_g >= TIMER3_100MS && !read_flag_state(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            network_searching_status_led_counter_g = 0;

            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
         }

         if (!read_flag_state(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
         }

         if (send_usart_data_errors_counter_g > 5 || is_piped_tasks_scheduler_full()) {

            send_usart_data_errors_counter_g = 0;

            unsigned char is_alarm_occured = is_piped_task_to_send_scheduled(SEND_ALARM_FLAG);
            delete_all_piped_tasks();
            clear_piped_request_commands_to_send();
            on_response_g = NULL;
            send_usart_data_function_g = NULL;

            successfully_received_flags_g = 0;
            sent_flag_g = 0;

            if (is_alarm_occured) {
               add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
            }

            GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
         }

         beep_and_schedule_alarm(&beeper_counter);
      } else if (esp8266_disabled_counter_g >= TIMER6_1S) {
         esp8266_disabled_counter_g = 0;
         enable_esp8266();
      }

      IWDG_ReloadCounter();
   }
}

void beep_and_schedule_alarm(unsigned char *beeper_counter) {
   if (read_flag_state(&general_flags_g, ALARM_FLAG)) {

      if (!beeper_inactive_timer_g) {
         beeper_inactive_timer_g = TIMER6_60S;
         *beeper_counter = 1;
         set_flag(&general_flags_g, BEEPER_SIGNAL_ALARM_FLAG);
         reset_flag(&general_flags_g, FREEZE_BEEPER_SERVER_ALARM_RECEIVED_FLAG);
      }

      if (is_piped_tasks_scheduler_empty()) {
         add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
         reset_flag(&general_flags_g, ALARM_FLAG);
      }
   }
   if (read_flag_state(&general_flags_g, BEEPER_SIGNAL_ALARM_FLAG) && *beeper_counter && !beeper_period_timer_g) {
      beeper_period_timer_g = TIMER6_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_period_timer_g = 0;
            beeper_alarm_prior_to_response_period_timer_g = TIMER6_1S;
            reset_flag(&general_flags_g, BEEPER_SIGNAL_ALARM_FLAG);
            break;
      }
   }

   if (read_flag_state(&general_flags_g, ALARM_SERVER_RECEIVED_FLAG) && !read_flag_state(&general_flags_g, BEEPER_SIGNAL_ALARM_FLAG)) {
      reset_flag(&general_flags_g, ALARM_SERVER_RECEIVED_FLAG);

      if (!read_flag_state(&general_flags_g, FREEZE_BEEPER_SERVER_ALARM_RECEIVED_FLAG)) {
         *beeper_counter = 1;
         set_flag(&general_flags_g, BEEPER_SERVER_ALARM_RECEIVED_FLAG);
      }
   }
   if (read_flag_state(&general_flags_g, BEEPER_SERVER_ALARM_RECEIVED_FLAG) &&
         !beeper_alarm_prior_to_response_period_timer_g && *beeper_counter && !beeper_period_timer_g) {
      beeper_period_timer_g = TIMER6_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_period_timer_g = 0;
            reset_flag(&general_flags_g, BEEPER_SERVER_ALARM_RECEIVED_FLAG);
            set_flag(&general_flags_g, FREEZE_BEEPER_SERVER_ALARM_RECEIVED_FLAG);
            break;
      }
   }
}

void check_connection_status_and_server_availability(unsigned short *counter) {
   if (*counter >= TIMER6_60S && is_piped_tasks_scheduler_empty()) {
      *counter = 0;
      add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_FLAG);
      add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   }
}

void execute_function_for_current_piped_task(unsigned int current_piped_task_to_send, unsigned char send_usart_data_passed_time_sec) {
   if (send_usart_data_function_g == NULL && current_piped_task_to_send) {
      if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
         execute_usart_data_sending(disable_echo, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_CONNECTION_STATUS_AND_CONNECT_FLAG ||
            current_piped_task_to_send == GET_CONNECTION_STATUS_FLAG) {
         execute_usart_data_sending(get_connection_status, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
         execute_usart_data_sending(get_network_list, 30, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
         execute_usart_data_sending(connect_to_network, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
         execute_usart_data_sending(connect_to_server, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
         execute_usart_data_sending(set_bytes_amount_to_send, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
         final_task_for_request_resending_g = GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 5, DO_NOT_EXECUTE_FUNCTION);
         send_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
         execute_usart_data_sending(get_current_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
         execute_usart_data_sending(set_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(get_own_ip_address, 5, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(set_own_ip_address, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CLOSE_CONNECTION_FLAG) {
         execute_usart_data_sending(close_connection, 20, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_FLAG) {
         // Request 1 part. Preparation
         delete_piped_task(GET_SERVER_AVAILABILITY_FLAG);
         get_server_avalability(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
      } else if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_REQUEST_FLAG) {
         // Request 2 part. Sending
         final_task_for_request_resending_g = GET_SERVER_AVAILABILITY_REQUEST_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION);

         send_request(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
      } else if (current_piped_task_to_send == SEND_ALARM_FLAG) {
         // Request 1 part. Preparation
         delete_piped_task(SEND_ALARM_FLAG);
         send_alarm(SEND_ALARM_REQUEST_FLAG);
      } else if (current_piped_task_to_send == SEND_ALARM_REQUEST_FLAG) {
         // Request 2 part. Sending
         final_task_for_request_resending_g = SEND_ALARM_REQUEST_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION);

