hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
         send_request(SEND_ALARM_REQUEST_FLAG);
      }
   }
}

void set_appropriate_successfully_recieved_flag() {
   if (read_flag_state(&sent_flag_g, DISABLE_ECHO_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(DISABLE_ECHO_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_VISIBLE_NETWORK_LIST_FLAG, ESP8226_RESPONSE_VISIBLE_NETWORK_LIST_PREFIX);
   }
   if (read_flag_state(&sent_flag_g, CONNECT_TO_NETWORK_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(CONNECT_TO_NETWORK_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG) || read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_FLAG)) {
      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
            set_flag(&successfully_received_flags_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
         } else {
            set_flag(&successfully_received_flags_g, GET_CONNECTION_STATUS_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         add_error();
      }

      if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
         reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
      } else {
         reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_FLAG);
      }
   }
   if (read_flag_state(&sent_flag_g, CONNECT_TO_SERVER_FLAG)) {
      reset_flag(&sent_flag_g, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         set_flag(&successfully_received_flags_g, CONNECT_TO_SERVER_FLAG);
      } else {
         add_error();
      }
   }
   if (read_flag_state(&sent_flag_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
      reset_flag(&sent_flag_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         set_flag(&successfully_received_flags_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         add_error();
      }
   }
   if (read_flag_state(&sent_flag_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
      reset_flag(&sent_flag_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_SUCCSESSFULLY_SENT, ESP8226_RESPONSE_PREFIX};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         set_flag(&successfully_received_flags_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         add_error();
      }
   }
   if (read_flag_state(&sent_flag_g, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG, ESP8226_RESPONSE_WIFI_MODE_PREFIX);
   }
   if (read_flag_state(&sent_flag_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_DEFAULT_STATION_WIFI_MODE_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG)) {
      reset_flag(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG);

      if (is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_CURRENT_OWN_IP_ADDRESS_PREFIX)) {
         set_flag(&successfully_received_flags_g, GET_OWN_IP_ADDRESS_FLAG);
      } else {
         add_error();
      }
   }
   if (read_flag_state(&sent_flag_g, SET_OWN_IP_ADDRESS_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_OWN_IP_ADDRESS_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, CLOSE_CONNECTION_FLAG)) {
      reset_flag(&sent_flag_g, CLOSE_CONNECTION_FLAG);
      set_flag(&successfully_received_flags_g, CLOSE_CONNECTION_FLAG);
   }
   if (read_flag_state(&sent_flag_g, GET_SERVER_AVAILABILITY_REQUEST_FLAG)) {
      if (is_received_data_length_equal(get_string_length(ESP8226_RESPONSE_SUCCSESSFULLY_SENT))) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         set_appropriate_successfully_recieved_flag_general_action(GET_SERVER_AVAILABILITY_REQUEST_FLAG, ESP8226_RESPONSE_SUCCSESSFULLY_SENT);
      }
   }
   if (read_flag_state(&sent_flag_g, SEND_ALARM_REQUEST_FLAG)) {
      if (is_received_data_length_equal(get_string_length(ESP8226_RESPONSE_SUCCSESSFULLY_SENT))) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         set_appropriate_successfully_recieved_flag_general_action(SEND_ALARM_REQUEST_FLAG, ESP8226_RESPONSE_SUCCSESSFULLY_SENT);
      }
   }
}

void set_appropriate_successfully_recieved_flag_general_action(unsigned int flag_value, char to_be_contained_in_response[]) {
   reset_flag(&sent_flag_g, flag_value);

   if (is_usart_response_contains_element(to_be_contained_in_response)) {
      set_flag(&successfully_received_flags_g, flag_value);
   } else {
      add_error();
   }
}

void add_error() {
   send_usart_data_errors_counter_g++;
   send_usart_data_errors_unresetable_counter_g++;
   last_error_task = get_current_piped_task_to_send();
}

void get_server_avalability(unsigned int request_task) {
   char *gain = array_to_string(default_access_point_gain_g, DEFAULT_ACCESS_POINT_GAIN_SIZE);
   char *errors_amount_string = num_to_string(send_usart_data_errors_unresetable_counter_g);
   char *usart_overrun_errors_counter_string = num_to_string(usart_overrun_errors_counter_g);
   char *usart_idle_line_detection_counter_string = num_to_string(usart_idle_line_detection_counter_g);
   char *usart_noise_detection_counter_string = num_to_string(usart_noise_detection_counter_g);
   char *usart_framing_errors_counter_string = num_to_string(usart_framing_errors_counter_g);
   char *last_error_task_string = num_to_string(last_error_task);
   last_error_task = 0;
   char *parameters_for_status[] = {gain, errors_amount_string, usart_overrun_errors_counter_string, usart_idle_line_detection_counter_string,
         usart_noise_detection_counter_string, usart_framing_errors_counter_string, last_error_task_string, NULL};
   char *status_json = set_string_parameters(STATUS_JSON, parameters_for_status);
   unsigned short status_string_length = get_string_length(status_json);
   char *status_string_length_string = num_to_string(status_string_length);
   char *parameters_for_request[] = {status_string_length_string, ESP8226_SERVER_IP_ADDRESS, status_json, NULL};
   char *request = set_string_parameters(ESP8226_REQUEST_SEND_STATUS_INFO_AND_GET_SERVER_AVAILABILITY, parameters_for_request);

   free(gain);
   free(errors_amount_string);
   free(usart_overrun_errors_counter_string);
   free(usart_idle_line_detection_counter_string);
   free(usart_noise_detection_counter_string);
   free(usart_framing_errors_counter_string);
   free(last_error_task_string);
   free(status_json);
   free(status_string_length_string);

   prepare_http_request(ESP8226_SERVER_IP_ADDRESS, ESP8226_SERVER_PORT, request, NULL, request_task);
}

void send_alarm(unsigned int request_task) {
   char *parameters_for_request[] = {ESP8226_SERVER_IP_ADDRESS, NULL};
   char *request = set_string_parameters(ESP8226_REQUEST_SEND_ALARM, parameters_for_request);

   prepare_http_request(ESP8226_SERVER_IP_ADDRESS, ESP8226_SERVER_PORT, request, NULL, request_task);
}

void get_own_ip_address() {
   send_usard_data(ESP8226_REQUEST_GET_OWN_IP_ADDRESS);
   set_flag(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG);
}

